package java_basics;


public class task1 {
    //Написать программу, выводящую информацию о себе.
    public static void main(String[] args) {
        System.out.println("Информация обо мне");
    }
}
