package java_basics;

import java.util.Arrays;
import java.util.Scanner;

public class task8 {
    //Реализуйте карту морского боя, которая выводится на экран.
    //(Нули - пустота, * - часть корабля)
    public static void main(String[] args) {

        String map [][] =  {
        { "*", "*", "0", "*", "0", "0", "*", "*", "*", "*"},
        {"0", "0", "0", "*", "0", "0", "0", "0", "0", "0"},
        {"0", "0", "0","*", "0", "0", "0", "0", "0", "*"},
        {"0", "0", "0", "0", "0", "0", "0", "0", "0", "*"},
        {"0", "*", "0", "0", "0", "0", "0", "0", "0", "0"},
        {"0", "*", "0", "0", "0", "0", "*", "0", "0", "0"},
        {"0", "*", "0", "0", "0", "0", "0", "0", "0", "0"},
        {"0", "0", "0", "0", "0", "0", "0", "0", "0", "0"},
        {"0", "0", "0", "*", "0", "*", "0", "0", "*", "0"},
        {"*", "0", "0", "0", "0", "0", "0", "0", "*", "0"}
    };

        System.out.println(Arrays.deepToString(map));

    }
}
